app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "price_in_cents", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Running Shoes"], ["description", "size 8"], ["price_in_cents", 3560], ["created_at", "2016-04-13 21:14:31.489582"], ["updated_at", "2016-04-13 21:14:31.489582"]]
---
  def create
    @product = Product.new(product_params)

    if @product.save